import {
  Dvr,
  Apartment,
  MedicalServices,
  School,
  Assessment,
  Home,
} from "@mui/icons-material";
import { nanoid } from "nanoid";

const pages = [
  {
    id: "home",
    title: "Головна",
    menuTitle: "Головна",
    type: "noCollapse",
    icon: <Home />,

    children: [
      {
        id: "all",
        title: "Головна",
        menuTitle: "Головна",
        type: "item",
        url: "home/all",
        target: true,

        chartsGroups: [
          {
            title: "Оцінка виконання завдань по структурних підрозділах",
            charts: [
              {
                id: "b",
                size: "sl",
                location: { x: 0, y: 0 },
                title: "Цифровізація",
                chartConfig: {
                  options: {
                    chart: {
                      id: "bar-chart",
                    },
                    plotOptions: {
                      bar: {
                        horizontal: true,
                      },
                    },

                    xaxis: {
                      categories: ["Виконано", "План на 01.01.2024"],
                    },
                  },
                  series: [
                    {
                      data: [80, 100],
                    },
                  ],
                  type: "bar",
                  aditionalSetings: {
                    singleInfo: null,
                    filterSelects: [],
                  },
                },
              },
              {
                id: "с",
                size: "sl",
                location: { x: 6, y: 0 },
                title: "Інфраструктура",
                chartConfig: {
                  options: {
                    chart: {
                      id: "bar-chart",
                    },
                    plotOptions: {
                      bar: {
                        horizontal: true,
                      },
                    },

                    xaxis: {
                      categories: ["Виконано", "План на 01.01.2024"],
                    },
                  },
                  series: [
                    {
                      data: [72, 100],
                    },
                  ],
                  type: "bar",
                  aditionalSetings: {
                    singleInfo: null,
                    filterSelects: [],
                  },
                },
              },
              {
                id: "o",
                size: "sl",
                location: { x: 0, y: 2 },
                title: "Охорона здоров'я",
                chartConfig: {
                  options: {
                    chart: {
                      id: "bar-chart",
                    },
                    plotOptions: {
                      bar: {
                        horizontal: true,
                      },
                    },

                    xaxis: {
                      categories: ["Виконано", "План на 01.01.2024"],
                    },
                  },
                  series: [
                    {
                      data: [66, 100],
                    },
                  ],
                  type: "bar",
                  aditionalSetings: {
                    singleInfo: null,
                    filterSelects: [],
                  },
                },
              },
              {
                id: "s",
                size: "sl",
                location: { x: 6, y: 2 },
                title: "Освіта",
                chartConfig: {
                  options: {
                    chart: {
                      id: "bar-chart",
                    },
                    plotOptions: {
                      bar: {
                        horizontal: true,
                      },
                    },

                    xaxis: {
                      categories: ["Виконано", "План на 01.01.2024"],
                    },
                  },
                  series: [
                    {
                      data: [74, 100],
                    },
                  ],
                  type: "bar",
                  aditionalSetings: {
                    singleInfo: null,
                    filterSelects: [],
                  },
                },
              },
              {
                id: "t",
                size: "sl",
                location: { x: 0, y: 4 },
                title: "Економіка",
                chartConfig: {
                  options: {
                    chart: {
                      id: "bar-chart",
                    },
                    plotOptions: {
                      bar: {
                        horizontal: true,
                      },
                    },

                    xaxis: {
                      categories: ["Виконано", "План на 01.01.2024"],
                    },
                  },
                  series: [
                    {
                      data: [79, 100],
                    },
                  ],
                  type: "bar",
                  aditionalSetings: {
                    singleInfo: null,
                    filterSelects: [],
                  },
                },
              },
            ],
          },
        ],
      },
    ],
  },
  {
    id: "digitalization",
    title: "Цифровізація",
    menuTitle: "Цифровізація",
    type: "collapse",
    icon: <Dvr />,

    children: [
      {
        id: "cnap",
        title: "ЦНАП",
        menuTitle: "ЦНАП",
        type: "item",
        url: "/digitalization/cnap",
        target: true,
        children: [
          {
            id: "net",
            title: "Мережа",
            menuTitle: "Мережа",
            type: "item",
            url: "cnap/net",
            target: true,
            chartsGroups: [
              {
                title: "Стан утворення мережі центрів",
                charts: [
                  {
                    id: "a",
                    size: "m",
                    title: "Усі центри",
                    location: { x: 0, y: 0 },
                    chartConfig: {
                      options: {
                        chart: {
                          id: "donut-chart",
                        },

                        dataLabels: {
                          enabled: true,
                          formatter: function (
                            value,
                            { seriesIndex, dataPointIndex, w }
                          ) {
                            return w.config.series[seriesIndex];
                          },
                        },
                        plotOptions: {
                          pie: {
                            donut: {
                              size: "50%",
                            },
                          },
                        },
                        legend: {
                          labels: {
                            colors: "#fff",
                          },
                          position: "top",
                        },
                        labels: ["ЦНАП", "ТП", "ВРМ", "Дія Центр"],
                      },
                      data: {
                        Всі: {
                          Всі: [64, 2, 44, 2],
                        },
                        Берігівський: {
                          Всі: [10, 0, 2, 0],
                          Великобийганська: [1, 0, 0, 0],
                          Вилоцька: [1, 0, 0, 0],
                          Виноградівська: [1, 0, 0, 0],
                          Батівська: [1, 0, 0, 0],
                          Пийтерфолівська: [1, 0, 0, 0],
                          Королівська: [1, 0, 0, 0],
                          Великоберезька: [1, 0, 0, 0],
                          Камянська: [1, 0, 2, 0],
                          Берегівська: [1, 0, 0, 0],
                          Косоньска: [1, 0, 0, 0],
                        },
                        Мукачівський: {
                          Всі: [13, 0, 19, 1],
                          Івановецька: [1, 0, 0, 0],
                          Полянська: [1, 0, 5, 0],
                          Мукачівська: [1, 0, 14, 1],
                          Верхньокоропецька: [1, 0, 0, 0],
                          Неліпинська: [1, 0, 0, 0],
                          Великолучівська: [1, 0, 0, 0],
                          Горондівська: [1, 0, 0, 0],
                          Жденіївська: [1, 0, 0, 0],
                          Кольчинська: [1, 0, 0, 0],
                          Нижньоворітська: [1, 0, 0, 0],
                          Свалявська: [1, 0, 0, 0],
                          Чинадіївська: [1, 0, 0, 0],
                          Воловецька: [1, 0, 0, 0],
                        },
                        Рахівський: {
                          Всі: [4, 1, 5, 0],
                          Великобичківська: [1, 1, 5, 0],
                          Рахівська: [1, 0, 0, 0],
                          Ясінянська: [1, 0, 0, 0],
                          Богданська: [1, 0, 0, 0],
                        },
                        Тячівський: {
                          Всі: [10, 0, 4, 0],
                          "Усть-Чорнянська": [1, 0, 0, 0],
                          Углянська: [1, 0, 0, 0],
                          Вільховецька: [1, 0, 0, 0],
                          Нересницька: [1, 0, 0, 0],
                          Бедевлянська: [1, 0, 0, 0],
                          Тячівська: [1, 0, 3, 0],
                          Солотвинська: [1, 0, 0, 0],
                          Буштинська: [1, 0, 0, 0],
                          Дубівська: [1, 0, 1, 0],
                          Тересвянська: [1, 0, 0, 0],
                        },
                        Ужгородський: {
                          Всі: [6, 0, 14, 1],
                          Оноківська: [1, 0, 1, 0],
                          Перечинська: [1, 0, 4, 0],
                          "Турє-Реметівська": [0, 0, 1, 0],
                          Чопська: [1, 0, 0, 0],
                          Середнянська: [1, 0, 0, 0],
                          Сюртівська: [1, 0, 0, 0],
                          "Дубриницько-Малоберезнянська": [1, 0, 0, 0],
                          Костринська: [1, 0, 0, 0],
                          Ставненьська: [1, 0, 0, 0],
                          Ужгородська: [1, 0, 0, 1],
                          Холмківська: [0, 0, 0, 0],
                          Баранинська: [1, 0, 0, 0],
                          Великоберезнянська: [1, 0, 0, 0],
                          Великодобронська: [1, 0, 0, 0],
                        },
                        Хустський: {
                          Всі: [11, 1, 9, 0],
                          Колочавська: [1, 0, 0, 0],
                          Драгівська: [1, 0, 0, 0],
                          Керецьківська: [0, 1, 2, 0],
                          Зарічанська: [1, 0, 0, 0],
                          Синевирська: [1, 0, 0, 0],
                          Горінчівська: [1, 0, 0, 0],
                          Міжгірська: [1, 0, 0, 0],
                          Іршавська: [1, 0, 0, 0],
                          Білківська: [1, 0, 4, 0],
                          Вишківська: [1, 0, 0, 0],
                          Пилипецька: [1, 0, 0, 0],
                          Хустська: [0, 0, 0, 0],
                          Довжанська: [1, 0, 3, 0],
                        },
                      },

                      type: "donut",
                      aditionalSetings: {
                        singleInfo: null,
                        filterSelects: [
                          {
                            id: nanoid(),
                            position: "1",
                            title: "Райони",

                            subSelect: {
                              id: nanoid(),
                              position: "2",
                              title: "Громади",
                            },
                          },
                        ],
                      },
                    },
                  },
                  {
                    id: "b",
                    size: "ml",
                    location: { x: 4, y: 0 },
                    title: "ЦНАПи",
                    chartConfig: {
                      options: {
                        chart: {
                          id: "bar-chart",
                        },
                        plotOptions: {
                          bar: {
                            horizontal: true,
                          },
                        },

                        xaxis: {
                          categories: ["Виконано", "План на 01.01.2024"],
                        },
                      },
                      data: {
                        Всі: {
                          Всі: [{ data: [46, 64] }],
                        },
                        Берігівський: {
                          Всі: [{ data: [8, 10] }],
                          Великобийганська: [{ data: [1, 1] }],
                          Вилоцька: [{ data: [1, 1] }],
                          Виноградівська: [{ data: [1, 1] }],
                          Батівська: [{ data: [1, 1] }],
                          Пийтерфолівська: [{ data: [1, 1] }],
                          Королівська: [{ data: [1, 1] }],
                          Великоберезька: [{ data: [0, 1] }],
                          Камянська: [{ data: [1, 1] }],
                          Берегівська: [{ data: [1, 1] }],
                          Косоньска: [{ data: [0, 1] }],
                        },
                        Мукачівський: {
                          Всі: [{ data: [9, 13] }],
                          Івановецька: [{ data: [1, 1] }],
                          Полянська: [{ data: [1, 1] }],
                          Мукачівська: [{ data: [1, 1] }],
                          Верхньокоропецька: [{ data: [0, 1] }],
                          Неліпинська: [{ data: [0, 1] }],
                          Великолучівська: [{ data: [1, 1] }],
                          Горондівська: [{ data: [1, 1] }],
                          Жденіївська: [{ data: [0, 1] }],
                          Кольчинська: [{ data: [0, 1] }],
                          Нижньоворітська: [{ data: [1, 1] }],
                          Свалявська: [{ data: [1, 1] }],
                          Чинадіївська: [{ data: [1, 1] }],
                          Воловецька: [{ data: [1, 1] }],
                        },
                        Рахівський: {
                          Всі: [{ data: [3, 4] }],
                          Великобичківська: [{ data: [1, 1] }],
                          Рахівська: [{ data: [1, 1] }],
                          Ясінянська: [{ data: [1, 1] }],
                          Богданська: [{ data: [0, 1] }],
                        },
                        Тячівський: {
                          Всі: [{ data: [7, 10] }],
                          "Усть-Чорнянська": [{ data: [0, 1] }],
                          Углянська: [{ data: [0, 1] }],
                          Вільховецька: [{ data: [1, 1] }],
                          Нересницька: [{ data: [1, 1] }],
                          Бедевлянська: [{ data: [0, 1] }],
                          Тячівська: [{ data: [1, 1] }],
                          Солотвинська: [{ data: [1, 1] }],
                          Буштинська: [{ data: [1, 1] }],
                          Дубівська: [{ data: [1, 1] }],
                          Тересвянська: [{ data: [1, 1] }],
                        },
                        Ужгородський: {
                          Всі: [{ data: [9, 14] }],
                          Оноківська: [{ data: [1, 1] }],
                          Перечинська: [{ data: [1, 1] }],
                          "Турє-Реметівська": [{ data: [0, 0] }],
                          Чопська: [{ data: [1, 1] }],
                          Середнянська: [{ data: [0, 1] }],
                          Сюртівська: [{ data: [0, 1] }],
                          "Дубриницько-Малоберезнянська": [
                            {
                              data: [1, 1],
                            },
                          ],
                          Костринська: [{ data: [0, 1] }],
                          Ставненьська: [{ data: [0, 1] }],
                          Ужгородська: [{ data: [2, 2] }],
                          Холмківська: [{ data: [0, 0] }],
                          Баранинська: [{ data: [1, 1] }],
                          Великоберезнянська: [{ data: [1, 1] }],
                          Великодобронська: [{ data: [0, 1] }],
                        },
                        Хустський: {
                          Всі: [{ data: [8, 11] }],
                          Колочавська: [{ data: [1, 1] }],
                          Драгівська: [{ data: [1, 1] }],
                          Керецьківська: [{ data: [0, 0] }],
                          Зарічанська: [{ data: [0, 0] }],
                          Синевирська: [{ data: [0, 1] }],
                          Горінчівська: [{ data: [0, 1] }],
                          Міжгірська: [{ data: [1, 1] }],
                          Іршавська: [{ data: [1, 1] }],
                          Білківська: [{ data: [1, 1] }],
                          Вишківська: [{ data: [1, 1] }],
                          Пилипецька: [{ data: [0, 1] }],
                          Хустська: [{ data: [0, 0] }],
                          Довжанська: [{ data: [1, 1] }],
                        },
                      },
                      type: "bar",
                      aditionalSetings: {
                        singleInfo: null,
                        filterSelects: [
                          {
                            id: nanoid(),
                            position: "1",
                            title: "Райони",

                            subSelect: {
                              id: nanoid(),
                              position: "2",
                              title: "Громади",
                            },
                          },
                        ],
                      },
                    },
                  },
                ],
              },
            ],
          },
          {
            id: "inclusive",
            title: "Інклюзивність",
            menuTitle: "Інклюзивність",
            type: "item",
            url: "cnap/inclusive",
            target: true,
            chartsGroups: [
              {
                title:
                  "Забезпечення інклюзивності у ЦНАПах та іх функціональних підрозділах",
                charts: [
                  {
                    id: "a",
                    size: "sl",
                    location: { x: 0, y: 0 },
                    title: "Рейтинг по районам",
                    chartConfig: {
                      options: {
                        chart: {
                          id: "bar-chart",
                        },
                        plotOptions: {
                          bar: {
                            horizontal: true,
                          },
                        },

                        xaxis: {
                          categories: [
                            "Мукачівський",
                            "Тячівський",
                            "Ужгородський",
                            "Хустський",
                            "Берегівський",
                          ],
                        },
                      },
                      series: [
                        {
                          data: [39.9, 37.8, 36.5, 33.3, 28.2],
                        },
                      ],
                      type: "bar",
                      aditionalSetings: {
                        singleInfo: null,
                        filterSelects: [],
                      },
                    },
                  },
                  {
                    id: "b",
                    size: "sl",
                    location: { x: 6, y: 0 },
                    title: "Топ 5 громад",
                    chartConfig: {
                      options: {
                        chart: {
                          id: "bar-chart",
                        },
                        plotOptions: {
                          bar: {
                            horizontal: true,
                          },
                        },

                        xaxis: {
                          categories: [
                            "Горондівська",
                            "Ужгородська",
                            "Міжгірська",
                            "Великобийганська",
                            "Вилоцька",
                          ],
                        },
                      },
                      series: [
                        {
                          data: [83.3, 83.3, 83.3, 66.6, 66.6],
                        },
                      ],
                      type: "bar",
                      aditionalSetings: {
                        singleInfo: null,
                        filterSelects: [],
                      },
                    },
                  },
                  {
                    id: "c",
                    size: "ml",
                    location: { x: 0, y: 4 },
                    title: "Перегляд по окремим районам та громадам",
                    chartConfig: {
                      options: {
                        chart: {
                          id: "bar-chart",
                        },
                        plotOptions: {
                          bar: {
                            horizontal: false,
                          },
                        },
                        yaxis: {
                          min: 0,
                          max: 100,
                        },
                        xaxis: {
                          categories: [
                            "Пандус",
                            "Місце для тимчасового перебування",
                            "Сходи з поручнями",
                            "Санітарні кімнати",
                            "Матеріали надруковані шрифтом Брайля",
                            "Технічні рішення для обслуговування осіб",
                          ],
                          labels: {
                            hideOverlappingLabels: true,
                            maxHeight: 100,
                            trim: true,
                          },
                        },
                      },
                      data: {
                        Всі: {
                          Всі: {
                            Всі: [{ data: [60, 50, 40, 60, 15, 5] }],
                          },
                        },
                        Берігівський: {
                          Всі: {
                            Всі: [{ data: [58, 41, 33, 50, 0, 0] }],
                          },
                          Великобийганська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Вилоцька: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Виноградівська: {
                            Всі: [{ data: [100, 0, 0, 100, 0, 0] }],
                          },
                          Батівська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Пийтерфолівська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Королівська: {
                            Всі: [{ data: [100, 0, 0, 0, 0, 0] }],
                          },
                          Великоберезька: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Камянська: {
                            Всі: [{ data: [0, 0, 0, 100, 0, 0] }],
                          },
                          Берегівська: {
                            Всі: [{ data: [100, 100, 0, 0, 0, 0] }],
                          },
                          Косоньска: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                        },
                        Мукачівський: {
                          Всі: {
                            Всі: [{ data: [71, 68, 43, 53, 6, 3] }],
                          },
                          Івановецька: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Полянська: {
                            Всі: [{ data: [100, 33, 100, 100, 0, 0] }],
                            ВРМ: [{ data: [100, 20, 100, 100, 0, 0] }],
                          },
                          Мукачівська: {
                            Всі: [{ data: [80, 86, 13, 33, 6, 6] }],
                            ВРМ: [{ data: [85, 85, 7, 28, 0, 0] }],
                          },
                          Верхньокоропецька: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Неліпинська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Великолучівська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Горондівська: {
                            Всі: [{ data: [100, 100, 100, 100, 100, 0] }],
                          },
                          Жденіївська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Кольчинська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Нижньоворітська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Свалявська: {
                            Всі: [{ data: [0, 100, 100, 0, 0, 0] }],
                          },
                          Чинадіївська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Воловецька: {
                            Всі: [{ data: [0, 100, 0, 100, 0, 0] }],
                          },
                        },
                        Рахівський: {
                          Всі: {
                            Всі: [{ data: [10, 30, 10, 10, 0, 10] }],
                          },
                          Великобичківська: {
                            Всі: [{ data: [0, 14, 0, 0, 0, 0] }],
                          },
                          Рахівська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Ясінянська: {
                            Всі: [{ data: [0, 100, 0, 0, 0, 100] }],
                          },
                          Богданська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                        },
                        Тячівський: {
                          Всі: {
                            Всі: [{ data: [71, 42, 57, 57, 7, 7] }],
                          },
                          "Усть-Чорнянська": {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Углянська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Вільховецька: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Нересницька: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Бедевлянська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Тячівська: {
                            Всі: [{ data: [75, 25, 25, 75, 0, 0] }],
                            ВРМ: [{ data: [66, 0, 0, 66, 0, 0] }],
                          },
                          Солотвинська: {
                            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
                          },
                          Буштинська: {
                            Всі: [{ data: [100, 0, 100, 100, 0, 0] }],
                          },
                          Дубівська: {
                            Всі: [{ data: [100, 50, 100, 50, 50, 50] }],
                            ВРМ: [{ data: [100, 0, 100, 0, 0, 0] }],
                          },
                          Тересвянська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                        },
                        Ужгородський: {
                          Всі: {
                            Всі: [{ data: [60, 50, 40, 60, 15, 6] }],
                          },
                          Оноківська: {
                            Всі: [{ data: [100, 0, 50, 100, 0, 0] }],
                            ВРМ: [{ data: [100, 0, 0, 100, 0, 0] }],
                          },
                          Перечинська: {
                            Всі: [{ data: [60, 80, 20, 40, 0, 0] }],
                            ВРМ: [{ data: [50, 75, 0, 25, 0, 0] }],
                          },
                          "Турє-Реметівська": {
                            Всі: [{ data: [100, 100, 0, 100, 0, 0] }],
                            ВРМ: [{ data: [100, 100, 0, 100, 0, 0] }],
                          },
                          Чопська: {
                            Всі: [{ data: [100, 0, 100, 100, 100, 0] }],
                          },
                          Середнянська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Сюртівська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          "Дубриницько-Малоберезнянська": {
                            Всі: [{ data: [0, 100, 100, 100, 0, 0] }],
                          },
                          Костринська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Ставненьська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Ужгородська: {
                            Всі: [{ data: [100, 100, 100, 100, 50, 50] }],
                          },
                          Холмківська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Баранинська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Великоберезнянська: {
                            Всі: [{ data: [100, 100, 0, 100, 100, 0] }],
                          },
                          Великодобронська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                        },
                        Хустський: {
                          Всі: {
                            Всі: [{ data: [57, 47, 47, 38, 14, 4] }],
                          },
                          Колочавська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Драгівська: {
                            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
                          },
                          Керецьківська: {
                            Всі: [{ data: [50, 50, 25, 50, 25, 25] }],
                            ВРМ: [{ data: [0, 50, 0, 0, 0, 0] }],
                            ТП: [{ data: [100, 0, 0, 100, 100, 100] }],
                          },
                          Зарічанська: {
                            Всі: [{ data: [100, 100, 0, 100, 0, 0] }],
                          },
                          Синевирська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Горінчівська: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Міжгірська: {
                            Всі: [{ data: [100, 100, 100, 100, 100, 0] }],
                          },
                          Іршавська: {
                            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
                          },
                          Білківська: {
                            Всі: [{ data: [40, 20, 40, 20, 0, 0] }],
                            ВРМ: [{ data: [25, 0, 25, 0, 0, 0] }],
                          },
                          Вишківська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Пилипецька: {
                            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
                          },
                          Хустська: {
                            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
                          },
                          Довжанська: {
                            Всі: [{ data: [75, 50, 75, 50, 25, 0] }],
                            ВРМ: [{ data: [66, 33, 100, 33, 0, 0] }],
                          },
                        },
                      },
                      type: "bar",
                      aditionalSetings: {
                        singleInfo: null,
                        filterSelects: [
                          {
                            id: nanoid(),
                            position: "1",
                            title: "Райони",

                            subSelect: {
                              id: nanoid(),
                              position: "2",
                              title: "Громада",

                              subSelect: {
                                id: nanoid(),
                                position: "3",
                                title: "Тип",
                              },
                            },
                          },
                        ],
                      },
                    },
                  },
                ],
              },
            ],
          },
          {
            id: "barrier-free",
            title: "Безбар'єрність",
            menuTitle: "Безбар'єрність",
            type: "item",
            url: "cnap/barrier-free",
            target: true,
          },
        ],
      },
    ],
  },
  {
    id: "infrastructure",
    title: "Інфраструктура",
    menuTitle: "Інфраструктура",
    type: "noCollapse",
    icon: <Apartment />,

    children: [
      {
        id: "all",
        title: "Інфраструктура - загальна",
        menuTitle: "Загальна",
        type: "item",
        url: "/infrastructure/all",
        target: true,
      },
    ],
  },
  {
    id: "healthcare",
    title: "Охорона здоров'я",
    menuTitle: "Охорона здоров'я",
    type: "noCollapse",
    icon: <MedicalServices />,

    children: [
      {
        id: "all",
        title: "Охорона здоров'я - загальна",
        menuTitle: "Загальна",
        type: "item",
        url: "/healthcare/all",
        target: true,
      },
    ],
  },
  {
    id: "education",
    title: "Освіта",
    menuTitle: "Освіта",
    type: "noCollapse",
    icon: <School />,

    children: [
      {
        id: "all",
        title: "Освіта- загальна",
        menuTitle: "Загальна",
        type: "item",
        url: "/education/all",
        target: true,
      },
    ],
  },
  {
    id: "economy",
    title: "Економіка",
    menuTitle: "Економіка",
    type: "noCollapse",
    icon: <Assessment />,

    children: [
      {
        id: "all",
        title: "Економіка - загальна",
        menuTitle: "Загальна",
        type: "item",
        url: "/economy/all",
        target: true,
      },
    ],
  },
];

export default pages;
